Catalogs/РасчетыСтатейСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>РасчетыСтатейСметы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>РасчетСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнПараметраРучнойВвод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗнПараметраФормула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойВвод</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФормула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаполняетсяДокументами</Name>
							<Comment>Не пересчитывается при расчете сметы</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроведениеДокументов</Name>
					<Comment>Если статья проведения зависит от структуры сметы, то она должна быть описана в этой табличной части</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Comment>Если документ проводится по нескольким статьям, то реквизит должен быть заполнен</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяСметы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСуммы</Name>
							<Comment>Тип суммы, если требуется уточнение</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/РасчетыСтатейСметы/Ext/ManagerModule.bsl
Процедура РасчетСметы(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РасчетСметы)
	Макет = Справочники.РасчетыСтатейСметы.ПолучитьМакет("РасчетСметы");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетыСтатейСметы.Наименование,
	|	РасчетыСтатейСметы.РасчетСметы.(
	|		НомерСтроки,
	|		КодСтатьи,
	|		ИмяСтатьи,
	|		Статья,
	|		ЗнПараметраРучнойВвод,
	|		ЗнПараметраФормула,
	|		СуммаРучнойВвод,
	|		СуммаФормула,
	|		ЗаполняетсяДокументами
	|	)
	|ИЗ
	|	Справочник.РасчетыСтатейСметы КАК РасчетыСтатейСметы
	|ГДЕ
	|	РасчетыСтатейСметы.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Заголовок");
	Шапка 					= Макет.ПолучитьОбласть("Шапка");
	ОбластьРасчетСметыШапка = Макет.ПолучитьОбласть("РасчетСметыШапка");
	ОбластьРасчетСметы 		= Макет.ПолучитьОбласть("РасчетСметы");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРасчетСметыШапка);
		ВыборкаРасчетСметы = Выборка.РасчетСметы.Выбрать();
		Пока ВыборкаРасчетСметы.Следующий() Цикл
			ОбластьРасчетСметы.Параметры.Заполнить(ВыборкаРасчетСметы);
			ТабДок.Вывести(ОбластьРасчетСметы, ВыборкаРасчетСметы.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
